fix: remaining legacy uml issue
